In [1]:
from sqlalchemy import create_engine
import pandas as pd

In [2]:
engine = create_engine('sqlite:///sqlite_db_pythonsqlite.db')

In [3]:
table_names = engine.table_names()
print(table_names)

['Bookings', 'Facilities', 'Members']

In [4]:
con = engine.connect()
rs = con.execute('SELECT f.name, SUM(CASE WHEN b.memid = 0 THEN f.guestcost * b.slots ELSE f.membercost * b.slots END) AS totalcost FROM Bookings AS b INNER JOIN Facilities AS f USING(facid) GROUP BY f.name HAVING totalcost < 1000 ORDER BY totalcost')
df = pd.DataFrame(rs.fetchall())
df.columns = rs.keys()
con.close()

In [5]:
print(df)

            name  totalcost
0   Table Tennis        180
1  Snooker Table        240
2     Pool Table        270

In [6]:
con = engine.connect()
rs = con.execute('SELECT m1.surname, m1.firstname, m2.firstname AS recFirst, m2.surname AS recLast FROM (SELECT * FROM Members WHERE recommendedby > 0) AS m1 LEFT JOIN Members as m2 ON m1.recommendedby = m2.memid ORDER BY m1.surname, m1.firstname')
df = pd.DataFrame(rs.fetchall())
df.columns = rs.keys()
con.close()
print(df)

              surname  firstname   recFirst   recLast
0               Bader   Florence     Ponder  Stibbons
1               Baker       Anne     Ponder  Stibbons
2               Baker    Timothy     Jemima   Farrell
3              Boothe        Tim        Tim    Rownam
4             Butters     Gerald     Darren     Smith
5              Coplin       Joan    Timothy     Baker
6             Crumpet      Erica      Tracy     Smith
7                Dare      Nancy     Janice  Joplette
8             Genting    Matthew     Gerald   Butters
9                Hunt       John  Millicent   Purview
10              Jones      David     Janice  Joplette
11              Jones    Douglas      David     Jones
12           Joplette     Janice     Darren     Smith
13          Mackenzie       Anna     Darren     Smith
14               Owen    Charles     Darren     Smith
15             Pinker      David     Jemima   Farrell
16            Purview  Millicent      Tracy     Smith
17             Rumney  Henrietta    Matthew   Genting
18             Sarwin  Ramnaresh   Florence     Bader
19              Smith       Jack     Darren     Smith
20           Stibbons     Ponder     Burton     Tracy
21  Worthington-Smyth      Henry      Tracy     Smith

In [7]:
con = engine.connect()
rs = con.execute('SELECT f.name, SUM(slots) AS memberslotsbooked FROM Bookings INNER JOIN Facilities AS f USING (facid) WHERE memid > 0 GROUP BY f.name')
df = pd.DataFrame(rs.fetchall())
df.columns = rs.keys()
con.close
print(df)

              name  memberslotsbooked
0  Badminton Court               1086
1   Massage Room 1                884
2   Massage Room 2                 54
3       Pool Table                856
4    Snooker Table                860
5     Squash Court                418
6     Table Tennis                794
7   Tennis Court 1                957
8   Tennis Court 2                882

In [8]:
con = engine.connect()
rs = con.execute('SELECT f.name, strftime("%m", starttime) AS month, SUM(slots) AS memberslotsbooked FROM Bookings AS b INNER JOIN Facilities AS f USING (facid) WHERE memid > 0 GROUP BY f.name, month')
df = pd.DataFrame(rs.fetchall())
df.columns = rs.keys()
con.close()
print(df)

               name month  memberslotsbooked
0   Badminton Court    07                165
1   Badminton Court    08                414
2   Badminton Court    09                507
3    Massage Room 1    07                166
4    Massage Room 1    08                316
5    Massage Room 1    09                402
6    Massage Room 2    07                  8
7    Massage Room 2    08                 18
8    Massage Room 2    09                 28
9        Pool Table    07                110
10       Pool Table    08                303
11       Pool Table    09                443
12    Snooker Table    07                140
13    Snooker Table    08                316
14    Snooker Table    09                404
15     Squash Court    07                 50
16     Squash Court    08                184
17     Squash Court    09                184
18     Table Tennis    07                 98
19     Table Tennis    08                296
20     Table Tennis    09                400
21   Tennis Court 1    07                201
22   Tennis Court 1    08                339
23   Tennis Court 1    09                417
24   Tennis Court 2    07                123
25   Tennis Court 2    08                345
26   Tennis Court 2    09                414